artillery/stress-test.yml
config:
    target: 'http://localhost:3000'
    phases:
        - duration: 10
          arrivalRate: 10 # 10 users per second = 100 total

    payload:
        path: './users.csv'
        fields:
            - 'email'
            - 'password'
        order: sequence

scenarios:
    - name: 'Full checkout flow'
      flow:
          - post:
                url: '/auth/login'
                json:
                    email: '{{ email }}'
                    password: '{{ password }}'
                capture:
                    - json: '$.accessToken'
                      as: 'token'

          # Clear any leftover cart items first
          - delete:
                url: '/cart'
                headers:
                    Authorization: 'Bearer {{ token }}'

          - post:
                url: '/cart/items'
                headers:
                    Authorization: 'Bearer {{ token }}'
                json:
                    productId: 'be737e32-69ec-4515-93c5-bbfb3036453c'
                    quantity: 1

          - post:
                url: '/orders'
                headers:
                    Authorization: 'Bearer {{ token }}'